Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-54-56.tmx
Source language: bo
Languages: en

source: །བླ་ན་མེད་པའི་གཟུགས་ཀྱི་ལུས་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམིགས་པ་ཐམས་ཅད་དུ་རྗེས་སུ་སོང་བ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་རབ་ཏུ་གཞོལ་བ། ཐམས་ཅད་དུ་རབ་ཏུ་གནས་པ་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ། སྟོན་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི། ཡིད་དུ་འོང་བ་ཡང་ཡོངས་སུ་སྦྱངས་སོ།
en: I also purified the unsurpassable form body that transcends all worlds, that is perceived by all beings according to their aspirations, that is spread throughout all buddha realms, that is present everywhere, that manifests all miracles in every place, and that is attractive to all beings.

source: །རིགས་ཀྱི་བུ་ངས་ལུས་ཐོབ་པ་ཕུན་སུམ་ཚོགས་པ། བསྐལ་པ་རྒྱ་མཚོ་མཐའ་ཡས་པས་ཡོངས་སུ་གྲུབ་པ། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོས། འབྱུང་བར་དཀའ་བ་མཐོང་བར་དཀའ་བ་འདི་ལ་ལྟོས།
en: “Noble one, regard this perfect body I have attained, which has been accomplished through an endless ocean of kalpas and which is rare to appear and rare to see in many hundreds of thousands of quintillions of kalpas.

source: རིགས་ཀྱི་བུ་ང་ནི་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པའི་སེམས་ཅན་རྣམས་ཀྱི་རྣ་ལམ་དུ་ཡང་མི་འོང་ན། མཐོང་བར་ལྟ་ཇི་ཞིག་སྨོས།
en: “Noble one, those beings who have not developed roots of merit cannot hear me, let alone see me.

source: རིགས་ཀྱི་བུ་སེམས་ཅན་གང་དག་ངའི་མིང་ཐོས་པ་ཙམ་གྱིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་ཡོད་དོ།
en: “Noble one, those beings who just hear my name become irreversible in their progress toward the highest, complete enlightenment.

source: །མཐོང་བ་ཙམ་དང་། རེག་པ་ཙམ་དང་། བསྐྱལ་པ་ཙམ་དང་། རྗེས་སུ་འབྲང་བ་ཙམ་དང་། རྨི་ལམ་དུ་མཐོང་བ་ཙམ་དང་། རྨི་ལམ་དུ་མིང་ཐོས་པ་ཙམ་གྱིས་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་ཡོད་དེ།
en: Those who just see me, touch me, accompany me, follow me, see me in a dream, or hear my name in a dream become irreversible in their progress toward the highest, complete enlightenment.

source: སེམས་ཅན་ལ་ལས་ནི་ང་ཉིན་ཞག་གཅིག་ཏུ་དྲན་པར་བྱས་ན་ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །ལ་ལས་ནི་ཞག་བདུན་དང་། ལ་ལས་ནི་ཟླ་བ་ཕྱེད་དང་། ལ་ལས་ནི་ཟླ་བ་གཅིག་དང་། ལ་ལས་ནི་ལོ་གཅིག་དང་། ལ་ལས་ནི་ལོ་བརྒྱ་དང་། ལ་ལས་ནི་བསྐལ་པ་གཅིག་དང་། ལ་ལས་ནི་བསྐལ་པ་བརྒྱ་ནས། ལ་ལས་ནི་བསྐལ་བ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ་ང་རྗེས་སུ་དྲན་པར་བྱས་ན། ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །ལ་ལས་ནི་ཚེ་གཅིག་ཏུ་རྗེས་སུ་དྲན་པར་བྱས་ན། ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ།
en: “Some, through thinking of me, become ripened in one day, some in one week, some in a fortnight, some in a month, some in a year, some in a hundred years, some in a kalpa, some in a hundred kalpas, and some in as many kalpas as there are atoms in an anabhilāpyānabhilāpya of buddha realms.

source: །ལ་ལས་ནི་ཚེའི་རྒྱུད་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ།
en: Some become ripened after as many lifetimes as there are atoms in an anabhilāpyānabhilāpya of buddha realms.

source: །སེམས་ཅན་ལ་ལས་ནི་ངའི་འོད་མཐོང་བས་ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །ལ་ལས་ནི་འོད་ཟེར་བཀྱེ་བ་མཐོང་བས་ལ་ལས་ནི་ཞིང་བསྐྱོད་པས་ལ་ལས་ནི་གཟུགས་ཀྱི་ལུས་བསྟན་པས་ལ་ལས་ནི་དགའ་བར་བྱས་པས་ཡོངས་སུ་སྨིན་པར་འགྱུར་ཏེ།
en: Some become ripened through seeing my light, some through seeing the light rays I radiate, some through the realm shaking, some through the manifestation of my form body, and some through rejoicing in it.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཐབས་ཀྱི་ཚུལ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སེམས་ཅན་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: “Noble one, in that way, through as many methods as there are atoms in a buddha realm, beings become irreversible in their progress toward the highest, complete enlightenment.

source: །རིགས་ཀྱི་བུ་སེམས་ཅན་གང་གིས་ངའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཐོབ་པ་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་སྐྱེའོ།
en: “Noble one, the beings who hear of my pure buddha realm will be reborn in pure buddha realms.

source: །གང་གིས་ངའི་ལུས་ཡོངས་སུ་དག་པ་མཐོང་བར་གྱུར་པ་དེ་དག་ནི་ངའི་ལུས་ལྟ་བུར་སྐྱེ་བར་འགྱུར་གྱིས་རིགས་ཀྱི་བུ་ངའི་ལུས་རྣམ་པར་དག་པ་འདི་ལ་ལྟོས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་ལུས་ལ་བསམ་པ་དང་། བ་སྤུའི་བུ་ག་རེ་རེ་ལ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་སངས་རྒྱས་སྐྱེ་བས་ཡོངས་སུ་གང་བ་མཐོང་ངོ་།
en: Those who see my pure body will be reborn with a body like mine. Therefore, noble one, look at my body.” Sudhana, the head merchant’s son, contemplated the body of the bodhisattva Samanta­bhadra and saw an anabhilāpyānabhilāpya of oceans of buddha realms in each pore.

source: །ཞིང་རྒྱ་མཚོ་རེ་རེ་ན་ཡང་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་རྒྱ་མཚོས་ཀུན་ནས་བསྐོར་བ་མང་པོ་བཞུགས་པ་མཐོང་ངོ་།
en: He saw in each of those oceans of realms tathāgatas encircled by oceans of assemblies of bodhisattvas.

source: །ཞིང་རྒྱ་མཚོ་དེ་དག་ཐམས་ཅད་ཀྱང་གཞི་སྣ་ཚོགས་དང་དབྱིབས་སྣ་ཚོགས་དང་། རྒྱན་སྣ་ཚོགས་དང་འཁོར་ཡུག་སྣ་ཚོགས་དང་སྤྲིན་སྣ་ཚོགས་དང་ནམ་མཁའ་སྣ་ཚོགས་ཀྱིས་ཀུན་ནས་ཁེབས་པ་དང་། སངས་རྒྱས་འབྱུང་བ་སྣ་ཚོགས་དང་ཆོས་ཀྱི་འཁོར་ལོ་སྣ་ཚོགས་ཀྱི་དབྱངས་དང་ལྡན་པར་མཐོང་ངོ་།
en: He saw all those oceans of realms as having various grounds, various shapes, various arrays, and various Cakravāla mountain ranges, covered by various clouds and various skies, and possessing various appearances of buddhas and the sound of various Dharma wheels.

source: །བ་སྤུའི་བུ་ག་རེ་རེ་ལ་ཇི་ལྟ་བ་བཞིན་དུ་བ་སྤུའི་བུ་ག་མ་ལུས་པ་ཐམས་ཅད་དང་། མཚན་ཐམས་ཅད་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་དང་། ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ལ་ཡང་དེ་བཞིན་ཏེ།
en: What he saw in each pore he saw in all pores without exception, in all the physical signs and features of a great being, and in all the greater and smaller parts of the body.

source: ཞིང་རྒྱ་མཚོ་རེ་རེ་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་སྐུ་སྤྲུལ་པའི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས་ཕྱོགས་བཅུར་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་མཐོང་ངོ་།
en: He saw clouds of emanations of bodies of buddhas, as numerous as the atoms in all buddha realms, appearing in each of the oceans of realms, pervading all the world realms in the ten directions, and ripening beings for the highest, complete enlightenment.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པས་རྗེས་སུ་བསྟན་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་ལུས་ཀྱི་ཁོངས་སུ་གཏོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་ཞུགས་ཏེ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་གྱུར་ཏོ། །དེ་ལྟར་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་གི་དྲུང་དུ་ཕྱིན་ཏེ།
en: Sudhana, the head merchant’s son, having been taught the instructions and teachings of the bodhisattva Samanta­bhadra, entered all the world realms that were within the body of the bodhisattva Samanta­bhadra and ripened beings.

source: མཐོང་བ་དང་བསྙེན་བཀུར་བས་ཡེ་ཤེས་ཀྱི་སྣང་བ་དང་། དགེ་བའི་རྩ་བ་བསྩགས་པ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་སྟེ། དགེ་བའི་རྩ་བ་བསྩགས་པར་གྱུར་བ་དེའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: The roots of merit accumulated by Sudhana, the head merchant’s son, through the light of knowledge by coming before, seeing, and honoring as many kalyāṇamitras as there are atoms in a buddha realm, were not a hundredth of the roots of merit accumulated by seeing the bodhisattva Samanta­bhadra;

source: །སྟོང་གི་ཆར་ཡང་མ་ཡིན་བརྒྱ་སྟོང་གི་ཆར་ཡང་མ་ཡིན། བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་གི་ཆར་ཡང་མ་ཡིན་ཏེ། གྲངས་དང་ཆ་དང་བགྲང་བ་དང་དཔེར་བྱ་བ་དང་། རྒྱུར་བྱ་བ་ཙམ་དུ་ཡང་མི་ཕོད་དོ།
en: they were not even a thousandth, were not even a trillionth, and could not even be an enumeration, a fraction, a number, an analogy, or a basis for it.

source: །དེས་དང་པོ་སེམས་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་མཐོང་བའི་བར་དེར་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་མཚོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཇི་སྙེད་ཅིག་ལ་ཞུགས་པར་གྱུར་པ་དེ་དག་པས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བར་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་བ་སྤུའི་བུ་ག་རེ་རེར་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་མཚོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་མང་པོ་ལ་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་ཞུགས་པར་གྱུར་ཏེ།
en: However many successions of oceans of buddha realms Sudhana apprehended from first developing the aspiration for enlightenment until he saw the bodhisattva Samanta­bhadra, he apprehended in each instant of mind even more successions of oceans of buddha realms, as many as there are atoms in an anabhilāpyānabhilāpya of buddha realms, in each of the bodhisattva Samanta­bhadra’s pores.

source: བ་སྤུའི་བུ་ག་རེ་རེར་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བ་སྤུའི་བུ་ག་མ་ལུས་པ་ཐམས་ཅད་ལ་ཡང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་རྣམ་པར་གནོན་པ་ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་བསྐལ་བར་བྱིན་གྱིས་བརླབས་པ། འཇིག་རྟེན་གྱི་ཁམས་རྒྱས་པར་འགེངས་པས་ཞུགས་ཀྱང་ཞིང་རྒྱ་མཚོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་མཐར་ཕྱིན་པར་མ་གྱུར་ཏེ།
en: Just as it was in each of his pores, so it was in all his pores without exception, and even if in each instant of mind Sudhana were to arrive at world realms as numerous as the atoms in an anabhilāpyānabhilāpya of buddha realms and continue spreading through world realms until the last of future kalpas, he would still not reach the end of those successions of oceans of buddha realms.

source: ཞིང་རྒྱ་མཚོའི་ལྷུན་དང་ཞིང་རྒྱ་མཚོའི་བྱེ་བྲག་དང་། ཞིང་རྒྱ་མཚོ་ཡོངས་སུ་བསྡུ་བ་དང་། ཞིང་རྒྱ་མཚོ་ཡོངས་སུ་འགྲུབ་པ་དང་། ཞིང་རྒྱ་མཚོ་འཇིག་པ་དང་། ཞིང་རྒྱ་མཚོ་རྣམ་པར་ཕྱེ་བ་དང་། སངས་རྒྱས་བྱུང་བ་རྒྱ་མཚོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དང་། སངས་རྒྱས་བྱུང་བ་རྒྱ་མཚོའི་སྐུ་དང་། སངས་རྒྱས་བྱུང་བ་རྒྱ་མཚོའི་བྱེ་བྲག་དང་། སངས་རྒྱས་བྱུང་བ་རྒྱ་མཚོ་ཡོངས་སུ་བསྡུ་བ་དང་། སངས་རྒྱས་བྱུང་བ་རྒྱ་མཚོ་ཡོངས་སུ་འབྱུང་བ་དང་། སངས་རྒྱས་བྱུང་བ་རྒྱ་མཚོ་ཡོངས་སུ་འཇིག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོའི་ལུས་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོའི་བྱེ་བྲག་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཡོངས་སུ་བསྡུ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཡོངས་སུ་འབྱུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཡོངས་སུ་འཇིག་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ལ་འཇུག་པ་དང་། སྐད་ཅིག་རེ་རེས་སེམས་ཅན་གྱི་དབང་པོ་ཤེས་པ་ལ་འཇུག་པ་དང་། སེམས་ཅན་གྱི་དབང་པོ་ཤེས་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་ཞིང་གདུལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་འཕྲུལ་བ་ཟབ་མོ་ལ་རྣམ་པར་གནས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནན་པའི་རྣམ་པར་གནོན་པ་རྒྱ་མཚོའི་མཐར་ཡང་ཕྱིན་པར་མ་གྱུར་ཏེ།
en: He would not reach the end of the forms of the oceans of realms, the particulars of the oceans of realms, the groupings of the oceans of realms, the origination of the oceans of realms, the destruction of the oceans of realms, the categories of the oceans of realms, the succession of the oceans of the appearances of buddhas, the bodies of the oceans of the appearances of buddhas, the particulars of the oceans of the appearances of buddhas, the groupings of the oceans of the appearances of buddhas, the originations of the oceans of the appearances of buddhas, the destruction of the oceans of the appearances of buddhas, the oceans of the bodhisattva assemblies of followers, the successions of the oceans of the bodhisattva assemblies of followers, the particulars of the oceans of the bodhisattva assemblies of followers, the groupings of the oceans of the bodhisattva assemblies of followers, the origination of the oceans of the bodhisattva assemblies of followers, the destruction of the oceans of the bodhisattva assemblies of followers, the entries into the realms of beings, the entries in each instant into the knowledge of the faculties of beings, the realizations of the knowledge of the faculties of beings, the ripening and guiding of beings, or the practices of the profound bodhisattva miracles and would not reach the end of the ocean of the ascending of bodhisattva bhūmis.

source: དེ་ཞིང་ལ་ལར་ནི་བསྐལ་པར་རྣམ་པར་སྤྱད་པར་གྱུར་ཏོ།
en: He was active in some realms for a kalpa.

source: །ཞིང་ལ་ལར་ནི་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དུ་སྤྱད་པར་གྱུར་ཏེ།
en: He was active in some realms for as many kalpas as there are atoms in an anabhilāpyānabhilāpya of realms, and he did not depart from those realms.

source: ཞིང་དེ་དག་ནས་ཀྱང་གཡོས་པ་མེད་དོ། །སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡང་ཞིང་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ལ་འཇུག་ཅིང་སེམས་ཅན་རྣམས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་གྱུར་ཏེ། དེས་དེ་ལྟར་མཐར་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་སྨོན་ལམ་རྒྱ་མཚོ་མཉམ་པ་ཉིད་ཀྱི་བར་དུ་འང་ཐོབ་པར་གྱུར་ཏོ།
en: In each instant of mind, he ripened beings for the highest, complete enlightenment in a vast extent of an ocean of realms with no end or middle, until in that way he eventually attained equality with the ocean of the prayers and the conduct of the bodhisattva Samanta­bhadra.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་མཉམ་པ་ཉིད་དང་། ཞིང་ཐམས་ཅད་ལུས་ཀྱིས་རྒྱས་པར་དགང་བ་མཉམ་པ་ཉིད་དང་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་རྒྱས་པར་དགང་བ་མཉམ་པ་ཉིད་དང་། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་བ་ཡོངས་སུ་བསྟན་པས་རྒྱས་པར་དགང་བ་མཉམ་པ་ཉིད་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་མཉམ་པ་ཉིད་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་དང་། དབྱངས་བརྗོད་པ་མཉམ་པ་ཉིད་དང་། དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་སྦྱོར་བ་མཉམ་པ་ཉིད་དང་། སྟོབས་དང་མི་འཇིག་པ་མཉམ་པ་ཉིད་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་སྤྱོད་པ་མཉམ་པ་ཉིད་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་མཉམ་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྣམ་པར་འཕྲུལ་པ་མཉམ་པ་ཉིད་ཀྱི་རྗེས་སུ་ཐོབ་པར་གྱུར་ཏོ།
en: He attained equality with all the tathāgatas, equality with their pervasion of all realms by their bodies, equality with their fulfillment of conduct, equality with their manifesting the miraculous manifestation of the attainment of complete buddhahood, equality with their turning the wheel of the Dharma, equality with their pure discernment, equality with the utterances of their voices, equality with the engagement in the oceans of all the aspects of their voices, equality with their great love and great compassion, and equality with the miraculous manifestation of the inconceivable liberations of the bodhisattvas.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོས་བསྐལ་བ་དང་། བསྐལ་པ་འབྱམ་ཀླས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་པོ་དེ་དག་བརྣན་ཏེ་མངོན་པར་བརྗོད་པའི་ཕྱིར་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་སྨོན་ལམ་བཏབ་པ།
en: The bodhisattva mahāsattva Samanta­bhadra then composed these verses in order to further elucidate kalpas, the vast extent of kalpas, and world realms as numerous as the atoms in an anabhilāpyānabhilāpya of buddha realms: However many lions among men there are

source: །ཇི་སྙེད་སུ་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན། །དུས་གསུམ་གཤེགས་པ་མི་ཡི་སེང་གེ་ཀུན།
en: In the three times, in the worlds in the ten directions,

source: །བདག་གིས་མ་ལུས་དེ་དག་ཐམས་ཅད་ལ།
en: I pay homage to them all without exception,

source: ལུས་དང་ངག་ཡིད་དང་བས་ཕྱག་བགྱིའོ།
en: With purity of body, speech, and mind. Thinking that all the jinas are before me,

source: །བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་སྟོབས་དག་གིས།
en: With the power of the prayer of good conduct,

source: །རྒྱལ་བ་ཐམས་ཅད་ཡིད་ཀྱིས་མངོན་སུམ་དུ།
en: I bow down toward all the jinas

source: །ཞིང་གི་རྡུལ་སྙེད་ལུས་རབ་བཏུད་པ་ཡིས། །རྒྱལ་བ་ཀུན་ལ་རབ་ཏུ་ཕྱག་འཚལ་ལོ།
en: With as many bodies as there are atoms in the realms.

source: །རྡུལ་གཅིག་སྟེང་ན་རྡུལ་སྙེད་སངས་རྒྱས་རྣམས།
en: There are as many buddhas as atoms within a single atom,

source: །སངས་རྒྱས་སྲས་ཀྱི་དབུས་ན་བཞུགས་པ་དག།
en: Seated in the midst of bodhisattvas. I focus on the entire realm of phenomena,

source: །དེ་ལྟར་ཆོས་ཀྱི་དབྱིངས་རྣམས་མ་ལུས་པར།
en: Without exception, being filled by jinas in that way. I recite a praise of all the sugatas,

source: །ཐམས་ཅད་རྒྱལ་བ་དག་གིས་གང་བར་མོས །དེ་དག་བསྔགས་པ་མི་ཟད་རྒྱ་མཚོ་རྣམས།
en: Enumerating the qualities of all the jinas, With unending oceans of eulogies

source: །དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོའི་སྒྲ་ཀུན་གྱིས། །རྒྱལ་བ་ཀུན་གྱི་ཡོན་ཏན་རབ་བརྗོད་ཅིང་།
en: And the sound of oceans of every quality of voice.

source: །བདེ་བར་གཤེགས་པ་ཐམས་ཅད་བདག་གིས་བསྟོད།
en: I make an offering to those jinas

source: །མེ་ཏོག་དམ་པ་ཕྲེང་བ་དམ་པ་དང་། །སིལ་སྙན་རྣམས་དང་བྱུག་པའི་གདུགས་མཆོག་དང་། །མར་མེ་མཆོག་དང་བདུག་པ་དམ་པ་ཡིས།
en: Of perfect flowers, perfect garlands, Perfect music, ointments, and parasols, Perfect lights, and perfect incenses.

source: །རྒྱལ་བ་དེ་དག་ལ་ནི་མཆོད་པར་བགྱི།
en: I make offerings to those jinas

source: །ན་བཟའ་དམ་པ་རྣམས་དང་དྲི་མཆོག་དང་། །ཕྱེ་མའི་ཕུར་མ་རི་རབ་མཉམ་པ་དང་། །ཁྱད་པར་ཅན་གྱི་རྒྱན་མཆོག་ཐམས་ཅད་ཀྱིས། །རྒྱལ་བ་དེ་དག་ལ་ནི་མཆོད་པར་བགྱི།
en: Of perfect clothing and perfect perfumes, Pouches of scented powders equal to Mount Meru, And all perfect, sublime displays.

source: །མཆོད་པ་གང་རྣམས་བླ་མེད་རྒྱ་ཆེ་བ།
en: Offerings that are unsurpassable and exalted

source: །དེ་དག་རྒྱལ་བ་ཐམས་ཅད་ལ་ཡང་མོས།
en: I am resolved to offer to all the jinas. I praise and make offerings to all the jinas

source: །བཟང་པོ་སྤྱོད་ལ་དད་པའི་སྟོབས་དག་གིས། །རྒྱལ་བ་ཀུན་ལ་ཕྱག་འཚལ་མཆོད་པར་བགྱི།
en: Through the power of devotion to good conduct. Whatever bad actions I have done

source: །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་དབང་གིས་ན།
en: Under the power of desire, anger, and ignorance,

source: །ལུས་དང་ངག་དང་དེ་བཞིན་ཡིད་ཀྱིས་ཀྱང་། །སྡིག་པ་བདག་གིས་བགྱིས་པ་ཅི་མཆིས་པ།
en: With my body, speech, and mind,

source: །དེ་དག་ཐམས་ཅད་བདག་གིས་སོ་སོར་བཤགས།
en: I make a confession of them all. I am rejoicing in the entirety of merit

source: །ཕྱོགས་བཅུའི་རྒྱལ་བ་ཀུན་དང་སངས་རྒྱས་སྲས།
en: In the ten directions that is created by beings, By practicing and accomplished pratyeka­buddhas,

source: །རང་རྒྱལ་རྣམས་དང་སློབ་དང་མི་སློབ་དང་། །འགྲོ་བ་རྣམས་ཀྱི་བསོད་ནམས་གང་ལ་ཡང་།
en: By the bodhisattvas, and by all the jinas.

source: །དེ་དག་ཀུན་གྱི་རྗེས་སུ་བདག་ཡི་རང་།
en: I make the request to all the lords,

source: །གང་རྣམས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་སྒྲོན་མ་དག །བྱང་ཆུབ་རིམ་པར་སངས་རྒྱས་མ་ཆགས་བརྙེས། །མགོན་པོ་དེ་དག་བདག་གིས་ཐམས་ཅད་ལ།
en: The lamps of the worlds in the ten directions, Who have attained without impediment the enlightenment of buddhahood,

source: །འཁོར་ལོ་བླ་ན་མེད་པ་བསྐོར་བར་བསྐུལ།
en: That they turn the unsurpassable wheel. With palms placed together, I supplicate

source: །མྱ་ངན་འདའ་སྟོན་གང་བཞེད་དེ་དག་ལ།
en: Those who wish to manifest passing into nirvāṇa That they remain for as many kalpas as there are atoms in the realms,

source: །འགྲོ་བ་ཀུན་ལ་ཕན་ཞིང་བདེ་བའི་ཕྱིར།
en: For the benefit and happiness of all beings.

source: །བསྐལ་བ་ཞིང་གི་རྡུལ་སྙེད་བཞུགས་པར་ཡང་།
en: Whatever little virtue I have accumulated

source: །བདག་གིས་ཐལ་མོ་རབ་སྦྱར་གསོལ་བར་བགྱི།
en: Through homage, offering, confession,

source: །ཕྱག་འཚལ་བ་དང་མཆོད་ཅིང་བཤགས་པ་དང་། །རྗེས་སུ་ཡི་རང་བསྐུལ་ཞིང་གསོལ་བ་ཡི། །དགེ་བ་ཅུང་ཟད་བདག་གིས་ཅི་བསྩགས་པ།
en: Rejoicing, supplication, and entreating,

source: །ཐམས་ཅད་བདག་གིས་བྱང་ཆུབ་ཕྱིར་བསྔོའོ།
en: I dedicate it all to enlightenment.

source: །འདས་པའི་སངས་རྒྱས་རྣམས་དང་ཕྱོགས་བཅུ་ཡི། །འཇིག་རྟེན་དག་ན་གང་བཞུགས་མཆོད་པར་གྱུར།
en: May the buddhas of the past and those who are present In the worlds of the ten directions be offered to.

source: གང་ཡང་མ་བྱོན་དེ་དག་རབ་མྱུར་བར།
en: May those in the future swiftly fulfill

source: །བསམ་རྫོགས་བྱང་ཆུབ་རིམ་པར་སངས་རྒྱས་སྤྱོན།
en: Their aspirations for the enlightenment of buddhahood.

source: །ཕྱོགས་བཅུ་ག་ལའི་ཞིང་རྣམས་ཇི་སྙེད་པ།
en: May the realms that are in the ten directions

source: །དེ་དག་རྒྱ་ཆེར་ཡོངས་སུ་དག་པར་གྱུར།
en: Become purified and sublime. May they become filled with jinas, who have come

source: །བྱང་ཆུབ་ཤིང་དབང་དྲུང་གཤེགས་རྒྱལ་བ་དང་། །སངས་རྒྱས་སྲས་ཀྱིས་རབ་ཏུ་གང་བར་ཤོག །ཕྱོགས་བཅུའི་སེམས་ཅན་གང་རྣམས་ཇི་སྙེད་པ།
en: To the Bodhi tree, the lord of trees, and with bodhisattvas. However many beings there are in the ten directions,

source: །དེ་དག་རྟག་ཏུ་ནད་མེད་བདེ་བར་གྱུར།
en: May they all be always happy and healthy.

source: །འགྲོ་བ་ཀུན་གྱི་ཆོས་ཀྱི་དོན་རྣམས་ནི།
en: May all beings be successful in their Dharma goals,

source: །འཐུན་པར་གྱུར་ཅིང་རེ་བའང་གྲུབ་པར་ཤོག །བྱང་ཆུབ་སྤྱོད་པ་དག་ནི་བདག་སྤྱོད་ཅིང་།
en: And may their wishes be fulfilled. May I practice the conduct of enlightenment

source: །འགྲོ་བ་ཀུན་ཏུ་སྐྱེ་བ་དྲན་པར་གྱུར།
en: And remember my lives in all existences. May I always practice mendicancy

source: །ཚེ་རབས་ཀུན་ཏུ་འཆི་འཕོ་སྐྱེ་བ་ན།
en: In all my lifetimes of deaths and rebirths.

source: །རྟག་ཏུ་བདག་ནི་རབ་ཏུ་འབྱུང་བར་ཤོག །རྒྱལ་བ་ཀུན་གྱི་རྗེས་སུ་སློབ་གྱུར་ཏེ།
en: Following the teaching of all the jinas

source: །བཟང་པོ་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་བྱེད་ཅིང་།
en: And perfecting my good conduct,

source: །ཚུལ་ཁྲིམས་སྤྱོད་པ་དྲི་མེད་ཡོངས་དག་པར།
en: May I always practice stainless, pure,

source: །རྟག་ཏུ་མ་ཉམས་སྐྱོན་མེད་སྤྱོད་པར་ཤོག །ལྷ་ཡི་སྐད་དང་ཀླུ་དང་གནོད་སྦྱིན་སྐད།
en: Correct conduct that is flawless and unblemished. May I teach the Dharma in all languages, Whatever the languages of beings: Through the languages of devas, the languages of nāgas,

source: །གྲུལ་བུམ་དག་དང་མི་ཡི་སྐད་རྣམས་དང་། །འགྲོ་བ་ཀུན་གྱི་སྒྲ་རྣམས་ཇི་ཙམ་པར། །ཐམས་ཅད་སྐད་དུ་བདག་གིས་ཆོས་བསྟན་ཏོ།
en: The languages of yakṣas, kumbhāṇḍas, and humans.

source: །ངེས་ཤིང་ཕ་རོལ་ཕྱིན་ལ་རབ་བརྩོན་ཏེ།
en: May one who is gentle and dedicated to the perfections

source: །བྱང་ཆུབ་སེམས་ནི་ནམ་ཡང་བརྗེད་མ་གྱུར།
en: Never forget the aspiration to enlightenment.

source: །སྡིག་པ་གང་རྣམས་སྒྲིབ་པར་འགྱུར་བ་དག །དེ་དག་མ་ལུས་ཡོངས་སུ་བྱང་བར་ཤོག །ལས་དང་ཉོན་མོངས་བདུད་ཀྱི་ལས་རྣམས་ལས།
en: May the obscurations of bad karma Be purified without any remainder.

source: །གྲོལ་ཞིང་འཇིག་རྟེན་འགྲོ་བ་རྣམས་སུ་ཡང་།
en: May my conduct, even in the worldly existences, Be free of karma, kleśas, and the actions of Māra

source: ཇི་ལྟར་པད་མོ་ཆུས་མི་ཆགས་པ་བཞིན།
en: Just as the lotus is unstained by water

source: །ཉི་ཟླ་ནམ་མཁར་ཐོགས་པ་མེད་ལྟར་སྤྱད། །ཞིང་གི་ཁྱོན་དང་ཕྱོགས་རྣམས་ཇི་ཙམ་པར།
en: And the sun and moon are unobstructed in the sky.

source: །ངན་སོང་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱེད།
en: May I end all the sufferings of lower existences

source: །བདེ་བ་དག་ལ་འགྲོ་བ་ཀུན་འགོད་ཅིང་།
en: And establish all beings in happiness,

source: །འགྲོ་བ་ཐམས་ཅད་ལ་ནི་ཕན་པར་སྤྱད།
en: Practicing a conduct that brings benefit to all beings Throughout the directions and the extent of realms.

source: །བྱང་ཆུབ་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་བྱེད་ཅིང་།
en: May I practice this conduct in all future kalpas,

source: །སེམས་ཅན་དག་གི་སྤྱོད་དང་མཐུན་པར་འཇུག །བཟང་པོ་སྤྱོད་པ་དག་ནི་རབ་སྟོན་ཅིང་།
en: Conforming with the conduct of beings, Perfecting the conduct of enlightenment, And teaching good conduct.

source: །མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་སྤྱོད་པར་འགྱུར།
en: May I always be in the company of those

source: །བདག་གི་སྤྱོད་དང་མཚུངས་པར་གང་སྤྱོད་པ།
en: Whose conduct is in harmony with my conduct.

source: །དེ་དག་དང་ནི་རྟག་ཏུ་འགྲོགས་པར་ཤོག །ལུས་དང་ངག་རྣམས་དང་ནི་སེམས་ཀྱིས་ཀྱང་།
en: May my body, my speech, and also my mind

source: །སྤྱོད་པ་དག་དང་སྨོན་ལམ་གཅིག་ཏུ་སྤྱད།
en: Practice the same conduct and have the same prayer. May I always associate

source: །བདག་ལ་ཕན་པར་འདོད་པའི་གྲོགས་པོ་དག །བཟང་པོ་སྤྱོད་པ་རབ་ཏུ་སྟོན་པ་རྣམས།
en: With friends who wish to benefit me And teach me the correct conduct,

source: །དེ་དག་དང་ཡང་རྟག་ཏུ་ཕྲད་པར་ཤོག །དེ་དག་བདག་གིས་ནམ་ཡང་ཡིད་མི་དབྱུང་།
en: And may I never displease them. May I always see before me the jinas,

source: །སངས་རྒྱས་སྲས་ཀྱིས་བསྐོར་བའི་མགོན་པོ་རྣམས། །མངོན་སུམ་རྟག་ཏུ་བདག་གིས་རྒྱལ་བ་ལྟ། །མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་མི་སྐྱོ་བར།
en: The lords who are encircled by bodhisattvas,

source: །དེ་དག་ལ་ཡང་མཆོད་པ་རྒྱ་ཆེར་བགྱི།
en: And may I make vast offerings to them, Without wearying, throughout all future kalpas.

source: །རྒྱལ་བ་རྣམས་ཀྱི་དམ་པའི་ཆོས་འཛིན་ཅིང་།
en: Keeping the good Dharma of the jinas,

source: །བྱང་ཆུབ་སྤྱོད་པ་ཀུན་ཏུ་སྣང་བར་བྱེད།
en: Expounding the conduct of enlightenment,

source: །བཟང་པོ་སྤྱོད་པ་རྣམ་པར་སྦྱངས་པ་ཡང་།
en: And purifying the good conduct,

source: །མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་སྤྱད་པར་བགྱི།
en: May I practice that conduct in all future kalpas.

source: །སྲིད་པ་ཐམས་ཅད་དུ་ཡང་འཁོར་བ་ན།
en: While circling through all existences,

source: །བསོད་ནམས་ཡེ་ཤེས་དག་ནི་མི་ཟད་རྙེད།
en: May I obtain inexhaustible merit and knowledge.
